Sample.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:Password xmlns:h="http://www.landisgyr.com/iec61968/2010/03" xmlns="http://www.landisgyr.com/iec61968/2010/03">username</h:Password><h:UserName xmlns:h="http://www.landisgyr.com/iec61968/2010/03" xmlns="http://www.landisgyr.com/iec61968/2010/03">password</h:UserName></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><RequestMessage xmlns="http://www.iec.ch/TC57/2008/schema/message"><Header><Verb>created</Verb><Noun>EndDeviceEvents</Noun><Revision>1.5</Revision><Context>DEVELOPMENT</Context><Timestamp>2017-10-11T19:19:12.1544347Z</Timestamp><Source>ElectSolve</Source><MessageID>cdd3c641-3929-486f-b331-539e6b7adf94</MessageID></Header><Request><StartTime>10/11/2017 7:19:12 PM</StartTime><EndTime>10/11/2017 8:19:12 PM</EndTime><Option>ReceiveAsyncEvent</Option></Request><Payload><anyType xsi:type="q1:ArrayOfEndDeviceEvent" xmlns:q1="http://www.landisgyr.com/iec61968/2010/03"><q1:EndDeviceEvent><category xmlns="http://iec.ch/TC57/2009/EndDeviceEvents#">6.20.1.185</category><createdDateTime xmlns="http://iec.ch/TC57/2009/EndDeviceEvents#">2017-10-11T19:19:12.1554361Z</createdDateTime><Assets xmlns="http://iec.ch/TC57/2009/EndDeviceEvents#"><mRID>abcde</mRID></Assets><status xmlns="http://iec.ch/TC57/2009/EndDeviceEvents#"><dateTime>2017-10-11T19:19:12.1554361Z</dateTime><value>POWER_FAIL</value></status></q1:EndDeviceEvent></anyType></Payload></RequestMessage></s:Body></s:Envelope>