mongosetup/EndPointTransaction.json

{"_id":{"$oid":"598204eb785a8b2678f228a2"},"InsertDate":{"$date":"2017-08-02T16:59:23.101Z"},"TransactionID":"7455ff0c-2149-4e31-b5b8-9b55ad73218b","MethodType":"EndDeviceControls","Request":"\u003c?xml version=\"1.0\" encoding=\"utf-8\"?\u003e\u003csoap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\u003e\u003csoap:Header\u003e\u003cCIMHeader xmlns=\"http://onrampwireless.com/cim\"\u003e7455ff0c-2149-4e31-b5b8-9b55ad73218b\u003c/CIMHeader\u003e\u003c/soap:Header\u003e\u003csoap:Body\u003e\u003cRequestMessage xmlns=\"http://www.iec.ch/TC57/2008/schema/message\"\u003e\u003cHeader\u003e\u003cVerb\u003eget\u003c/Verb\u003e\u003cNoun\u003eEndDeviceControls\u003c/Noun\u003e\u003cRevision\u003e1.4\u003c/Revision\u003e\u003cTimestamp\u003e2017-08-02T11:59:22.9146042-05:00\u003c/Timestamp\u003e\u003cSource\u003eMDMS\u003c/Source\u003e\u003cAsyncReplyFlag\u003etrue\u003c/AsyncReplyFlag\u003e\u003cReplyAddress\u003ehttp://10.86.1.81/MultiSpeakBroker/Cim/11/CIM.asmx\u003c/ReplyAddress\u003e\u003cCorrelationID\u003e7455ff0c-2149-4e31-b5b8-9b55ad73218b\u003c/CorrelationID\u003e\u003c/Header\u003e\u003cRequest\u003e\u003cm:EndDeviceControls xmlns:m=\"http://iec.ch/TC57/2009/EndDeviceControls#\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\u003e\u003cm:EndDeviceControl\u003e\u003cm:type\u003e3.31.6.42\u003c/m:type\u003e\u003cm:mRID\u003eMeter123\u003c/m:mRID\u003e\u003cm:EndDeviceAsset\u003e\u003cm:mRID\u003eMeter123\u003c/m:mRID\u003e\u003c/m:EndDeviceAsset\u003e\u003c/m:EndDeviceControl\u003e\u003c/m:EndDeviceControls\u003e\u003c/Request\u003e\u003c/RequestMessage\u003e\u003c/soap:Body\u003e\u003c/soap:Envelope\u003e","Response":"\u003c?xml version=\"1.0\" encoding=\"utf-8\"?\u003e\u003csoap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\u003e\u003csoap:Header\u003e\u003cCIMHeader xmlns=\"http://onrampwireless.com/cim\"\u003e7455ff0c-2149-4e31-b5b8-9b55ad73218b\u003c/CIMHeader\u003e\u003c/soap:Header\u003e\u003csoap:Body\u003e\u003cResponseMessage xmlns=\"http://www.iec.ch/TC57/2008/schema/message\"\u003e\u003cHeader\u003e\u003cVerb\u003eget\u003c/Verb\u003e\u003cNoun\u003eEndDeviceControls\u003c/Noun\u003e\u003cRevision\u003e1.4\u003c/Revision\u003e\u003cTimestamp\u003e2017-08-02T11:59:22.9146042-05:00\u003c/Timestamp\u003e\u003cSource\u003eCIM Controls Simulator\u003c/Source\u003e\u003cAsyncReplyFlag\u003etrue\u003c/AsyncReplyFlag\u003e\u003cReplyAddress\u003ehttp://10.86.1.81/MultiSpeakBroker/Cim/11/CIM.asmx\u003c/ReplyAddress\u003e\u003cCorrelationID\u003e7455ff0c-2149-4e31-b5b8-9b55ad73218b\u003c/CorrelationID\u003e\u003c/Header\u003e\u003cReply\u003e\u003cReplyCode\u003e0.0\u003c/ReplyCode\u003e\u003c/Reply\u003e\u003cPayload\u003e\u003cformat\u003eWe are not parsing this field, but send it anyway\u003c/format\u003e\u003c/Payload\u003e\u003c/ResponseMessage\u003e\u003c/soap:Body\u003e\u003c/soap:Envelope\u003e"}
{"_id":{"$oid":"5982058d785a8b2678f228a3"},"InsertDate":{"$date":"2017-08-02T17:02:05.291Z"},"TransactionID":"a248ca52-f64d-4a27-92dd-ae883d69aa67","MethodType":"EndDeviceControls","Request":"\u003c?xml version=\"1.0\" encoding=\"utf-8\"?\u003e\u003csoap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\u003e\u003csoap:Header\u003e\u003cCIMHeader xmlns=\"http://onrampwireless.com/cim\"\u003ea248ca52-f64d-4a27-92dd-ae883d69aa67\u003c/CIMHeader\u003e\u003c/soap:Header\u003e\u003csoap:Body\u003e\u003cRequestMessage xmlns=\"http://www.iec.ch/TC57/2008/schema/message\"\u003e\u003cHeader\u003e\u003cVerb\u003eget\u003c/Verb\u003e\u003cNoun\u003eEndDeviceControls\u003c/Noun\u003e\u003cRevision\u003e1.4\u003c/Revision\u003e\u003cTimestamp\u003e2017-08-02T12:02:05.2759772-05:00\u003c/Timestamp\u003e\u003cSource\u003eMDMS\u003c/Source\u003e\u003cAsyncReplyFlag\u003etrue\u003c/AsyncReplyFlag\u003e\u003cReplyAddress\u003ehttp://10.86.1.81/MultiSpeakBroker/Cim/11/CIM.asmx\u003c/ReplyAddress\u003e\u003cCorrelationID\u003ea248ca52-f64d-4a27-92dd-ae883d69aa67\u003c/CorrelationID\u003e\u003c/Header\u003e\u003cRequest\u003e\u003cm:EndDeviceControls xmlns:m=\"http://iec.ch/TC57/2009/EndDeviceControls#\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\u003e\u003cm:EndDeviceControl\u003e\u003cm:type\u003e3.31.6.42\u003c/m:type\u003e\u003cm:mRID\u003eMeter123\u003c/m:mRID\u003e\u003cm:EndDeviceAsset\u003e\u003cm:mRID\u003eMeter123\u003c/m:mRID\u003e\u003c/m:EndDeviceAsset\u003e\u003c/m:EndDeviceControl\u003e\u003c/m:EndDeviceControls\u003e\u003c/Request\u003e\u003c/RequestMessage\u003e\u003c/soap:Body\u003e\u003c/soap:Envelope\u003e","Response":"\u003c?xml version=\"1.0\" encoding=\"utf-8\"?\u003e\u003csoap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\u003e\u003csoap:Header\u003e\u003cCIMHeader xmlns=\"http://onrampwireless.com/cim\"\u003ea248ca52-f64d-4a27-92dd-ae883d69aa67\u003c/CIMHeader\u003e\u003c/soap:Header\u003e\u003csoap:Body\u003e\u003cResponseMessage xmlns=\"http://www.iec.ch/TC57/2008/schema/message\"\u003e\u003cHeader\u003e\u003cVerb\u003eget\u003c/Verb\u003e\u003cNoun\u003eEndDeviceControls\u003c/Noun\u003e\u003cRevision\u003e1.4\u003c/Revision\u003e\u003cTimestamp\u003e2017-08-02T12:02:05.2759772-05:00\u003c/Timestamp\u003e\u003cSource\u003eCIM Controls Simulator\u003c/Source\u003e\u003cAsyncReplyFlag\u003etrue\u003c/AsyncReplyFlag\u003e\u003cReplyAddress\u003ehttp://10.86.1.81/MultiSpeakBroker/Cim/11/CIM.asmx\u003c/ReplyAddress\u003e\u003cCorrelationID\u003ea248ca52-f64d-4a27-92dd-ae883d69aa67\u003c/CorrelationID\u003e\u003c/Header\u003e\u003cReply\u003e\u003cReplyCode\u003e0.0\u003c/ReplyCode\u003e\u003c/Reply\u003e\u003cPayload\u003e\u003cformat\u003eWe are not parsing this field, but send it anyway\u003c/format\u003e\u003c/Payload\u003e\u003c/ResponseMessage\u003e\u003c/soap:Body\u003e\u003c/soap:Envelope\u003e"}
